Splunk Links for Docs:
https://docs.splunk.com/Documentation/SCS/current/SearchReference/Introduction
https://docs.splunk.com/Documentation/SplunkCloud/latest/SearchReference/
https://docs.splunk.com/Documentation/SplunkCloud/latest/Search/




Basic Searching

- Explicit search syntax:
    search index="main" "UNKNOWN"
      - Searches for events stored in main. The term UNKNOWN is then used as a keyword to filter and retrieve events
      that include this specific term.
      - Wildcards * can be used to replace characters in searches and field values.

    (implicit search syntax)
    index="main" "*UNKNOWN*"





Fields and Comparison Operators

- Automatically ID's certain data fields such as:
    - source
    - sourcetype
    - host
    - EventCode

- Can be combined with comparison operators for more precise searches.

- Example:
    index="main" EventCode!=1
      - Search main for event codes that do not = 1.





The Fields Command

- Specifies which fields should be included or excluded in the search results

- Example:
    index="main" sourcetype="WinEventLog:Sysmon" EventCode=1 | fields - User
      - After retrieving all process creation events from main index, the fields commnad   
      excludes the User field from the search results. The results will contain all fields 
      normally found in the Sysmon Event ID 1 logs, except for the user that initiated the process.




The Table command

- Presents search results in a tabular format:
    index="main" sourcetype="WinEventLog:Sysmon" EventCode=1 | table _time, host, Image




The rename command

- renames a field in the search results:
    index="main" sourcetype="WinEventLog:Sysmon" EventCode=1 | rename Image as Process



The dedup command

- removes duplicate events:
    index="main" sourcetype="WinEventLog:Sysmon" EventCode=1 | dedup Image



The sort command

- sorts the search results
    index="main" sourcetype="WinEventLog:Sysmon" EventCode=1 | sort - _time



The stats command

- performs statistical operations
    index="main" sourcetype="WinEventLog:Sysmon" EventCode=3 | stats count by _time, Image



The char command

- creates a data visualization based on statistical operations
    index="main" sourcetype="WinEventLog:Sysmon" EventCode=3 | chart count by _time, Image



The eval command

- creates or redefines fields:
    index="main" sourcetype="WinEventLog:Sysmon" EventCode=1 | eval Process_Path=lower(Image)



The rex command

- extracts new fields from existing ones using regular expressions
    index="main" EventCode=4662 | rex max_match=0 "[^%](?<guid>{.*})" | table guid
      - rex max_match=0 "[^%](?<guid>{.*})" uses the rex command to extract values 
      matching the pattern from the events' fields. The regex pattern {.*} looks for 
      substrings that begin with { and end with }. The [^%] part ensures that the match 
      does not begin with a % character. The captured value within the curly braces is 
      assigned to the named capture group guid.
      - table guid displays the extracted GUIDs in the output. This command is used to 
      format the results and display only the guid field.
      - The max_match=0 option ensures that all occurrences of the pattern are extracted 
      from each event. By default, the rex command only extracts the first occurrence.




The lookup command

- enriches data with external sources

- Can create lookup table files in order to 



The inputlookup command

- retrieves data from a lookup file without joining it to the search results





Time range

- Self explanatory
    index="main" earliest=-7d EventCode!=1



The transaction command

- Used to group events that share common characteristics into transactions, often used to track sessions or
user activities that span across multiple events.



DATA AND FIELD IDENTIFICATION:

| eventcount summarize=false index=* | table index

        - Count all events in all indexes, then summarize=false is used to display counts for each index
        separately, and finally, the table command presents the data in tabular form



| metadata type=sourcetypes

        - metadata provides us with various statistics about specified indexed fields
        - Focusing on sourcetypes here
        - Lists all souretypes in splunk environment along with additional metadata such as 
        the first time a source type was seen (firstTime), the last time it was seen (lastTime)
        and the number of hosts (totalCount).


| metadata type=sourcetypes index=* | table sourcetype

        - retrieves metadata about the data in indexes. The type=sourcetypes argument tells Splunk 
        to return metadata about sourcetypes. 


| metadata type=sources index=* | table source

        - Returns a list of all data sources in Splunk Environment



sourcetype="WinEventLog:Security" | table *

        - Returns a table with all fields available in the WinEventLog:Security sourcetype.



sourcetype="WinEventLog:Security" | fields Account_Name, EventCode | table Account_Name, EventCode



sourcetype="WinEventLog:Security" | fieldsummary

        - Returns a table that includes every field found in the events returned by the search (across the
        sourcetype we've discussed. The table includes several columns of information about each field:

            - field: name of the field
            - count: number of events that contain the field
            - distinct_count: The number of distinct values in the field.
            - is_exact: Whether the count is exact or estimated.
            - max: The maximum value of the field.
            - mean: The mean value of the field.
            - min: The minimum value of the field.
            - numeric_count: The number of numeric values in the field.
            - stdev: The standard deviation of the field.
            - values: Sample values of the field.
            - modes: The most common values of the field.
            - numBuckets: The number of buckets used to estimate the distinct count.


index=* sourcetype=* | bucket _time span=1d | stats count by _time, index, sourcetype | sort - _time

        - Retrieves all data, then bucket comman is used to group the events based on the _time field into 
        one day buckets. The stat command then counts the number of events for each day , index, and sourcetype
        then sorts it in descending order of _time.



index=* sourcetype=* | rare limit=10 index, sourcetype

        - Rare command helps us ID uncommon event types, which might be indicative of abnormal behavior.
        This query retrieves all data and finds the 10 rarest combinations of indexes and souretypes.




index="main" | stats count by sourcetype



index="main" sourcetype="WinEventLog:Sysmon" EventCode=1 (Image="*cmd.exe" OR Image="*powershell.exe")
| stats count by ParentImage, Image





index="main" sourcetype="WinEventLog:Sysmon" EventCode=1 (Image="*cmd.exe" OR Image="*powershell.exe") ParentImage="C:\\Windows\\System32\\notepad.exe"
| stats count by ParentImage, Image




index="main" CallTrace="*UNKNOWN*" | where SourceImage!=TargetImage | stats count by SourceImage





