Splunk Links for Docs:
https://docs.splunk.com/Documentation/SCS/current/SearchReference/Introduction
https://docs.splunk.com/Documentation/SplunkCloud/latest/SearchReference/
https://docs.splunk.com/Documentation/SplunkCloud/latest/Search/




Basic Searching

- Explicit search syntax:
    search index="main" "UNKNOWN"
      - Searches for events stored in main. The term UNKNOWN is then used as a keyword to filter and retrieve events
      that include this specific term.
      - Wildcards * can be used to replace characters in searches and field values.

    (implicit search syntax)
    index="main" "*UNKNOWN*"





Fields and Comparison Operators

- Automatically ID's certain data fields such as:
    - source
    - sourcetype
    - host
    - EventCode

- Can be combined with comparison operators for more precise searches.

- Example:
    index="main" EventCode!=1
      - Search main for event codes that do not = 1.





The Fields Command

- Specifies which fields should be included or excluded in the search results

- Example:
    index="main" sourcetype="WinEventLog:Sysmon" EventCode=1 | fields - User
      - After retrieving all process creation events from main index, the fields commnad   
      excludes the User field from the search results. The results will contain all fields 
      normally found in the Sysmon Event ID 1 logs, except for the user that initiated the process.




The Table command

- Presents search results in a tabular format:
    index="main" sourcetype="WinEventLog:Sysmon" EventCode=1 | table _time, host, Image




The rename command

- renames a field in the search results:
    index="main" sourcetype="WinEventLog:Sysmon" EventCode=1 | rename Image as Process



The dedup command

- removes duplicate events:
    index="main" sourcetype="WinEventLog:Sysmon" EventCode=1 | dedup Image



The sort command

- sorts the search results
    index="main" sourcetype="WinEventLog:Sysmon" EventCode=1 | sort - _time



The stats command

- performs statistical operations
    index="main" sourcetype="WinEventLog:Sysmon" EventCode=3 | stats count by _time, Image



The char command

- creates a data visualization based on statistical operations
    index="main" sourcetype="WinEventLog:Sysmon" EventCode=3 | chart count by _time, Image



The eval command

- creates or redefines fields:
    index="main" sourcetype="WinEventLog:Sysmon" EventCode=1 | eval Process_Path=lower(Image)



The rex command

- extracts new fields from existing ones using regular expressions
    index="main" EventCode=4662 | rex max_match=0 "[^%](?<guid>{.*})" | table guid
      - rex max_match=0 "[^%](?<guid>{.*})" uses the rex command to extract values 
      matching the pattern from the events' fields. The regex pattern {.*} looks for 
      substrings that begin with { and end with }. The [^%] part ensures that the match 
      does not begin with a % character. The captured value within the curly braces is 
      assigned to the named capture group guid.
      - table guid displays the extracted GUIDs in the output. This command is used to 
      format the results and display only the guid field.
      - The max_match=0 option ensures that all occurrences of the pattern are extracted 
      from each event. By default, the rex command only extracts the first occurrence.




The lookup command

- enriches data with external sources

- Can create lookup table files in order to 



The inputlookup command

- retrieves data from a lookup file without joining it to the search results





Time range

- Self explanatory
    index="main" earliest=-7d EventCode!=1



The transaction command

- Used to group events that share common characteristics into transactions, often used to track sessions or
user activities that span across multiple events.



DATA AND FIELD IDENTIFICATION:

| eventcount summarize=false index=* | table index

        - Count all events in all indexes, then summarize=false is used to display counts for each index
        separately, and finally, the table command presents the data in tabular form



| metadata type=sourcetypes

        - metadata provides us with various statistics about specified indexed fields
        - Focusing on sourcetypes here
        - Lists all souretypes in splunk environment along with additional metadata such as 
        the first time a source type was seen (firstTime), the last time it was seen (lastTime)
        and the number of hosts (totalCount).










































